---
kind: method
id: M:Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution.#ctor
source: html/401b189d-ae7d-ecae-93f6-f3e2e164b1cb.htm
---
# Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution.#ctor Method

Creates a hemispherical light distribution object.

## Syntax (C#)
```csharp
public HemisphericalLightDistribution()
```